;主引导程序
;----------------------------------------
SECTION MBR vstart=0x7c00   ;在编译时，告诉编译器，把我的起始地址编译为0x7c00。

;用cs 寄存器的值去初始化其他寄存器。由于BIOS 是通过jmp 0：0x7c00 跳转到MBR 的，故cs此时为0
    mov ax,cs
    mov ds,ax
    mov es,ax
    mov fs,ax
    mov ss,ax
    mov sp,0x7c00   ;初始化栈指针

;清屏:利用0x06号功能,上卷全部行,则可清屏｡
;-----------------------------------------------------------
;INT 0x10 功能号:0x06 功能描述:上卷窗口
;------------------------------------------------------
;输入:
;AH 功能号= 0x06
;AL = 上卷的行数(如果为0,表示全部)
;BH = 上卷行属性
;(CL,CH) = 窗口左上角的(X,Y)位置
;(DL,DH) = 窗口右下角的(X,Y)位置
;无返回值:
    mov ax, 0x600
    mov bx, 0x700
    mov cx, 0           ; 左上角: (0, 0)
    mov dx, 0x184f      ; 右下角: (80,25),
                        ; VGA 文本模式中,一行只能容纳80个字符,共25行｡
                        ; 下标从0 开始,所以0x18=24,0x4f=79
    int 0x10 

;.get_cursor 获取当前光标位置,在光标位置处打印字符｡
    mov ah, 3 ; 输入: 3 号子功能是获取光标位置,需要存入ah 寄存器
    mov bh, 0 ; bh 寄存器存储的是待获取光标的页号

    int 0x10                ; 输出: ch=光标开始行,cl=光标结束行
                            ; dh=光标所在行号,dl=光标所在列号

;打印字符串
    mov ax,message
    mov bp,ax               ; es:bp 为串首地址,es 此时同cs 一致,
    
    ; 光标位置要用到dx 寄存器中内容,cx 中的光标位置可忽略
    mov cx, 5               ; cx 为串长度,不包括结束符0 的字符个数
    mov ax, 0x1301          ;子功能号13 显示字符及属性,要存入ah 寄存器,
                            ;al 设置写字符方式 ah=01: 显示字符串,光标跟随移动
    mov bx, 0x2             ; bh 存储要显示的页号,此处是第0 页,
                            ; bl 中是字符属性,属性黑底绿字(bl = 02h)
    int 0x10                ; 执行BIOS 0x10 号中断

;;;;;;;;; 打字字符串结束 ;;;;;;;;;;;;;;;
    jmp $ ; 使程序悬停在此

    message db "1 MBR"
    times 510-($-$$) db 0
    db 0x55,0xaa